

//  Задача 4. Напишите программу, которая принимает на вход число и проверяет, кратно ли оно 
//  одновременно 7 и 23.
//  14 -> нет 
//  46 -> нет 
//  161 -> да

 int a=322;

 if (a%7 == 0  & a%23 == 0)
 {

    Console.WriteLine("Да");
 }

 else
 {
     Console.WriteLine("Нет");
 }
 
